cf_billing/Documents/энргУстановитьФормулуРасчетаТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьФормулуРасчетаТочекУчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргРасчетныеСпособыТочекУчета</xr:Item>
				<xr:Item>InformationRegister.энргФормулыРасчетаТочекУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугами</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСЛицевымСчетом</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитываемаяТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАдресОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтроение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименятьВсегда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючПомещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьАбонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/CommonModules/энргРаботаСПериодомДействияКлиент/Ext/Module.bsl
#Область ОбработчикиСобытий

Процедура ОткрытьФормуДокументаПерерасчет(ДанныеДляПерерасчета) Экспорт 
	
	ПараметрыОтрытия  	= Новый Структура;
	Если ДанныеДляПерерасчета.свойство("Ключ") тогда
		ПараметрыОтрытия.Вставить("Ключ",ДанныеДляПерерасчета.ключ);
	КонецЕсли;
	ПараметрыОтрытия.вставить("ЗаполнитьДокумент",			Истина);
	ПараметрыОтрытия.Вставить("ЗначенияЗаполнения",			ДанныеДляПерерасчета.ДанныеЗаполнения);
	ПараметрыОтрытия.Вставить("ДополнительныеПараметры",	ДанныеДляПерерасчета.ДополнительныеПараметры);
	ФормаФормулы  		= ОткрытьФорму("Документ.энргПерерасчет.ФормаОбъекта",ПараметрыОтрытия);	
	
КонецПроцедуры

Процедура ОткрытьФормуДокументаУстановкаФормулыРасчета(ДанныеДляФормулы) Экспорт 
	
	ПараметрыОтрытия  	= Новый Структура;
	Если ДанныеДляФормулы.свойство("Ключ") тогда
		ПараметрыОтрытия.Вставить("Ключ",ДанныеДляФормулы.ключ);
	КонецЕсли;
	ПараметрыОтрытия.вставить("ЗаполнитьДокумент",Истина);
	ПараметрыОтрытия.Вставить("ЗначенияЗаполнения",ДанныеДляФормулы.ДанныеЗаполнения);		
	ФормаФормулы  		= ОткрытьФорму("Документ.энргУстановитьФормулуРасчетаТочекУчета.Форма.ФормаДокумента",ПараметрыОтрытия);	
	
КонецПроцедуры


#КонецОбласти

#Область КонтрольИзмененияДатыФактическогоСобытия

Процедура ПроверитьКорректностьДатыФактическогоСобытияКлиент(Организация, Район, Дата, ДатаФактическогоСобытия) Экспорт
	
	КорректностьДатыФактическогоСобытия = энргРаботаСПериодомДействия.ПолучитьКорректностьДатыФактическогоСобытия(Организация, Район, Дата, ДатаФактическогоСобытия);
	
	Если Не КорректностьДатыФактическогоСобытия Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Период даты факта должен быть меньше периода даты документа");	
		
	КонецЕсли;

	КонецПроцедуры

#КонецОбласти
